Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/**
 * \brief Component description for SFR
 *
 * Copyright (c) 2019 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-02-20T18:44:00Z */
#ifndef _SAM9X_SFR_COMPONENT_H_
#define _SAM9X_SFR_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SFR                                          */
/* ************************************************************************** */

/* -------- SFR_CCFG_EBICSA : (SFR Offset: 0x04) (R/W 32) EBI Chip Select Register -------- */
#define SFR_CCFG_EBICSA_EBI_CS1A_Pos          _U_(1)                                               /**< (SFR_CCFG_EBICSA) EBI Chip Select 1 Assignment Position */
#define SFR_CCFG_EBICSA_EBI_CS1A_Msk          (_U_(0x1) << SFR_CCFG_EBICSA_EBI_CS1A_Pos)           /**< (SFR_CCFG_EBICSA) EBI Chip Select 1 Assignment Mask */
#define SFR_CCFG_EBICSA_EBI_CS1A(value)       (SFR_CCFG_EBICSA_EBI_CS1A_Msk & ((value) << SFR_CCFG_EBICSA_EBI_CS1A_Pos))
#define SFR_CCFG_EBICSA_EBI_CS3A_Pos          _U_(3)                                               /**< (SFR_CCFG_EBICSA) EBI Chip Select 3 Assignment Position */
#define SFR_CCFG_EBICSA_EBI_CS3A_Msk          (_U_(0x1) << SFR_CCFG_EBICSA_EBI_CS3A_Pos)           /**< (SFR_CCFG_EBICSA) EBI Chip Select 3 Assignment Mask */
#define SFR_CCFG_EBICSA_EBI_CS3A(value)       (SFR_CCFG_EBICSA_EBI_CS3A_Msk & ((value) << SFR_CCFG_EBICSA_EBI_CS3A_Pos))
#define SFR_CCFG_EBICSA_EBI_CS4A_Pos          _U_(4)                                               /**< (SFR_CCFG_EBICSA) EBI Chip Select 4 Assignment Position */
#define SFR_CCFG_EBICSA_EBI_CS4A_Msk          (_U_(0x1) << SFR_CCFG_EBICSA_EBI_CS4A_Pos)           /**< (SFR_CCFG_EBICSA) EBI Chip Select 4 Assignment Mask */
#define SFR_CCFG_EBICSA_EBI_CS4A(value)       (SFR_CCFG_EBICSA_EBI_CS4A_Msk & ((value) << SFR_CCFG_EBICSA_EBI_CS4A_Pos))
#define SFR_CCFG_EBICSA_EBI_CS5A_Pos          _U_(5)                                               /**< (SFR_CCFG_EBICSA) EBI Chip Select 5 Assignment Position */
#define SFR_CCFG_EBICSA_EBI_CS5A_Msk          (_U_(0x1) << SFR_CCFG_EBICSA_EBI_CS5A_Pos)           /**< (SFR_CCFG_EBICSA) EBI Chip Select 5 Assignment Mask */
#define SFR_CCFG_EBICSA_EBI_CS5A(value)       (SFR_CCFG_EBICSA_EBI_CS5A_Msk & ((value) << SFR_CCFG_EBICSA_EBI_CS5A_Pos))
#define SFR_CCFG_EBICSA_EBI_DBPUC_Pos         _U_(8)                                               /**< (SFR_CCFG_EBICSA) EBI Data Bus Pullup Configuration Position */
#define SFR_CCFG_EBICSA_EBI_DBPUC_Msk         (_U_(0x1) << SFR_CCFG_EBICSA_EBI_DBPUC_Pos)          /**< (SFR_CCFG_EBICSA) EBI Data Bus Pullup Configuration Mask */
#define SFR_CCFG_EBICSA_EBI_DBPUC(value)      (SFR_CCFG_EBICSA_EBI_DBPUC_Msk & ((value) << SFR_CCFG_EBICSA_EBI_DBPUC_Pos))
#define SFR_CCFG_EBICSA_EBI_DBPDC_Pos         _U_(9)                                               /**< (SFR_CCFG_EBICSA) EBI Data Bus Pulldown Configuration Position */
#define SFR_CCFG_EBICSA_EBI_DBPDC_Msk         (_U_(0x1) << SFR_CCFG_EBICSA_EBI_DBPDC_Pos)          /**< (SFR_CCFG_EBICSA) EBI Data Bus Pulldown Configuration Mask */
#define SFR_CCFG_EBICSA_EBI_DBPDC(value)      (SFR_CCFG_EBICSA_EBI_DBPDC_Msk & ((value) << SFR_CCFG_EBICSA_EBI_DBPDC_Pos))
#define SFR_CCFG_EBICSA_EBI_DRIVE_Pos         _U_(16)                                              /**< (SFR_CCFG_EBICSA) EBI I/O Drive Configuration Position */
#define SFR_CCFG_EBICSA_EBI_DRIVE_Msk         (_U_(0x1) << SFR_CCFG_EBICSA_EBI_DRIVE_Pos)          /**< (SFR_CCFG_EBICSA) EBI I/O Drive Configuration Mask */
#define SFR_CCFG_EBICSA_EBI_DRIVE(value)      (SFR_CCFG_EBICSA_EBI_DRIVE_Msk & ((value) << SFR_CCFG_EBICSA_EBI_DRIVE_Pos))
#define SFR_CCFG_EBICSA_DQIEN_F_Pos           _U_(20)                                              /**< (SFR_CCFG_EBICSA) Force Analog Input Comparator Configuration Position */
#define SFR_CCFG_EBICSA_DQIEN_F_Msk           (_U_(0x1) << SFR_CCFG_EBICSA_DQIEN_F_Pos)            /**< (SFR_CCFG_EBICSA) Force Analog Input Comparator Configuration Mask */
#define SFR_CCFG_EBICSA_DQIEN_F(value)        (SFR_CCFG_EBICSA_DQIEN_F_Msk & ((value) << SFR_CCFG_EBICSA_DQIEN_F_Pos))
#define SFR_CCFG_EBICSA_NFD0_ON_D16_Pos       _U_(24)                                              /**< (SFR_CCFG_EBICSA) NAND Flash Databus Selection Position */
#define SFR_CCFG_EBICSA_NFD0_ON_D16_Msk       (_U_(0x1) << SFR_CCFG_EBICSA_NFD0_ON_D16_Pos)        /**< (SFR_CCFG_EBICSA) NAND Flash Databus Selection Mask */
#define SFR_CCFG_EBICSA_NFD0_ON_D16(value)    (SFR_CCFG_EBICSA_NFD0_ON_D16_Msk & ((value) << SFR_CCFG_EBICSA_NFD0_ON_D16_Pos))
#define SFR_CCFG_EBICSA_DDR_MP_EN_Pos         _U_(25)                                              /**< (SFR_CCFG_EBICSA) DDR Multi-port Enable Position */
#define SFR_CCFG_EBICSA_DDR_MP_EN_Msk         (_U_(0x1) << SFR_CCFG_EBICSA_DDR_MP_EN_Pos)          /**< (SFR_CCFG_EBICSA) DDR Multi-port Enable Mask */
#define SFR_CCFG_EBICSA_DDR_MP_EN(value)      (SFR_CCFG_EBICSA_DDR_MP_EN_Msk & ((value) << SFR_CCFG_EBICSA_DDR_MP_EN_Pos))
#define SFR_CCFG_EBICSA_Msk                   _U_(0x0311033A)                                      /**< (SFR_CCFG_EBICSA) Register Mask  */

#define SFR_CCFG_EBICSA_NFD0_ON_D_Pos         _U_(24)                                              /**< (SFR_CCFG_EBICSA Position) NAND Flash Databus Selection */
#define SFR_CCFG_EBICSA_NFD0_ON_D_Msk         (_U_(0x1) << SFR_CCFG_EBICSA_NFD0_ON_D_Pos)          /**< (SFR_CCFG_EBICSA Mask) NFD0_ON_D */
#define SFR_CCFG_EBICSA_NFD0_ON_D(value)      (SFR_CCFG_EBICSA_NFD0_ON_D_Msk & ((value) << SFR_CCFG_EBICSA_NFD0_ON_D_Pos)) 

/* -------- SFR_OHCIICR : (SFR Offset: 0x10) (R/W 32) OHCI Interrupt Configuration Register -------- */
#define SFR_OHCIICR_RES0_Pos                  _U_(0)                                               /**< (SFR_OHCIICR) USB PORTx Reset Position */
#define SFR_OHCIICR_RES0_Msk                  (_U_(0x1) << SFR_OHCIICR_RES0_Pos)                   /**< (SFR_OHCIICR) USB PORTx Reset Mask */
#define SFR_OHCIICR_RES0(value)               (SFR_OHCIICR_RES0_Msk & ((value) << SFR_OHCIICR_RES0_Pos))
#define SFR_OHCIICR_RES1_Pos                  _U_(1)                                               /**< (SFR_OHCIICR) USB PORTx Reset Position */
#define SFR_OHCIICR_RES1_Msk                  (_U_(0x1) << SFR_OHCIICR_RES1_Pos)                   /**< (SFR_OHCIICR) USB PORTx Reset Mask */
#define SFR_OHCIICR_RES1(value)               (SFR_OHCIICR_RES1_Msk & ((value) << SFR_OHCIICR_RES1_Pos))
#define SFR_OHCIICR_RES2_Pos                  _U_(2)                                               /**< (SFR_OHCIICR) USB PORTx Reset Position */
#define SFR_OHCIICR_RES2_Msk                  (_U_(0x1) << SFR_OHCIICR_RES2_Pos)                   /**< (SFR_OHCIICR) USB PORTx Reset Mask */
#define SFR_OHCIICR_RES2(value)               (SFR_OHCIICR_RES2_Msk & ((value) << SFR_OHCIICR_RES2_Pos))
#define SFR_OHCIICR_ARIE_Pos                  _U_(4)                                               /**< (SFR_OHCIICR) OHCI Asynchronous Resume Interrupt Enable Position */
#define SFR_OHCIICR_ARIE_Msk                  (_U_(0x1) << SFR_OHCIICR_ARIE_Pos)                   /**< (SFR_OHCIICR) OHCI Asynchronous Resume Interrupt Enable Mask */
#define SFR_OHCIICR_ARIE(value)               (SFR_OHCIICR_ARIE_Msk & ((value) << SFR_OHCIICR_ARIE_Pos))
#define SFR_OHCIICR_APPSTART_Pos              _U_(5)                                               /**< (SFR_OHCIICR) OHCI Clock Start Position */
#define SFR_OHCIICR_APPSTART_Msk              (_U_(0x1) << SFR_OHCIICR_APPSTART_Pos)               /**< (SFR_OHCIICR) OHCI Clock Start Mask */
#define SFR_OHCIICR_APPSTART(value)           (SFR_OHCIICR_APPSTART_Msk & ((value) << SFR_OHCIICR_APPSTART_Pos))
#define SFR_OHCIICR_SUSP0_Pos                 _U_(8)                                               /**< (SFR_OHCIICR) USB PORTx Position */
#define SFR_OHCIICR_SUSP0_Msk                 (_U_(0x1) << SFR_OHCIICR_SUSP0_Pos)                  /**< (SFR_OHCIICR) USB PORTx Mask */
#define SFR_OHCIICR_SUSP0(value)              (SFR_OHCIICR_SUSP0_Msk & ((value) << SFR_OHCIICR_SUSP0_Pos))
#define SFR_OHCIICR_SUSP1_Pos                 _U_(9)                                               /**< (SFR_OHCIICR) USB PORTx Position */
#define SFR_OHCIICR_SUSP1_Msk                 (_U_(0x1) << SFR_OHCIICR_SUSP1_Pos)                  /**< (SFR_OHCIICR) USB PORTx Mask */
#define SFR_OHCIICR_SUSP1(value)              (SFR_OHCIICR_SUSP1_Msk & ((value) << SFR_OHCIICR_SUSP1_Pos))
#define SFR_OHCIICR_SUSP2_Pos                 _U_(10)                                              /**< (SFR_OHCIICR) USB PORTx Position */
#define SFR_OHCIICR_SUSP2_Msk                 (_U_(0x1) << SFR_OHCIICR_SUSP2_Pos)                  /**< (SFR_OHCIICR) USB PORTx Mask */
#define SFR_OHCIICR_SUSP2(value)              (SFR_OHCIICR_SUSP2_Msk & ((value) << SFR_OHCIICR_SUSP2_Pos))
#define SFR_OHCIICR_UDPPUDIS_Pos              _U_(23)                                              /**< (SFR_OHCIICR) USB Device Pullup Disable Position */
#define SFR_OHCIICR_UDPPUDIS_Msk              (_U_(0x1) << SFR_OHCIICR_UDPPUDIS_Pos)               /**< (SFR_OHCIICR) USB Device Pullup Disable Mask */
#define SFR_OHCIICR_UDPPUDIS(value)           (SFR_OHCIICR_UDPPUDIS_Msk & ((value) << SFR_OHCIICR_UDPPUDIS_Pos))
#define SFR_OHCIICR_Msk                       _U_(0x00800737)                                      /**< (SFR_OHCIICR) Register Mask  */

#define SFR_OHCIICR_RES_Pos                   _U_(0)                                               /**< (SFR_OHCIICR Position) USB PORTx Reset */
#define SFR_OHCIICR_RES_Msk                   (_U_(0x7) << SFR_OHCIICR_RES_Pos)                    /**< (SFR_OHCIICR Mask) RES */
#define SFR_OHCIICR_RES(value)                (SFR_OHCIICR_RES_Msk & ((value) << SFR_OHCIICR_RES_Pos)) 
#define SFR_OHCIICR_SUSP_Pos                  _U_(8)                                               /**< (SFR_OHCIICR Position) USB PORTx */
#define SFR_OHCIICR_SUSP_Msk                  (_U_(0x7) << SFR_OHCIICR_SUSP_Pos)                   /**< (SFR_OHCIICR Mask) SUSP */
#define SFR_OHCIICR_SUSP(value)               (SFR_OHCIICR_SUSP_Msk & ((value) << SFR_OHCIICR_SUSP_Pos)) 

