Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/* -------- SFR_OHCIISR : (SFR Offset: 0x14) ( R/ 32) OHCI Interrupt Status Register -------- */
#define SFR_OHCIISR_RIS0_Pos                  _U_(0)                                               /**< (SFR_OHCIISR) OHCI Resume Interrupt Status Port 0 Position */
#define SFR_OHCIISR_RIS0_Msk                  (_U_(0x1) << SFR_OHCIISR_RIS0_Pos)                   /**< (SFR_OHCIISR) OHCI Resume Interrupt Status Port 0 Mask */
#define SFR_OHCIISR_RIS0(value)               (SFR_OHCIISR_RIS0_Msk & ((value) << SFR_OHCIISR_RIS0_Pos))
#define SFR_OHCIISR_RIS1_Pos                  _U_(1)                                               /**< (SFR_OHCIISR) OHCI Resume Interrupt Status Port 1 Position */
#define SFR_OHCIISR_RIS1_Msk                  (_U_(0x1) << SFR_OHCIISR_RIS1_Pos)                   /**< (SFR_OHCIISR) OHCI Resume Interrupt Status Port 1 Mask */
#define SFR_OHCIISR_RIS1(value)               (SFR_OHCIISR_RIS1_Msk & ((value) << SFR_OHCIISR_RIS1_Pos))
#define SFR_OHCIISR_RIS2_Pos                  _U_(2)                                               /**< (SFR_OHCIISR) OHCI Resume Interrupt Status Port 2 Position */
#define SFR_OHCIISR_RIS2_Msk                  (_U_(0x1) << SFR_OHCIISR_RIS2_Pos)                   /**< (SFR_OHCIISR) OHCI Resume Interrupt Status Port 2 Mask */
#define SFR_OHCIISR_RIS2(value)               (SFR_OHCIISR_RIS2_Msk & ((value) << SFR_OHCIISR_RIS2_Pos))
#define SFR_OHCIISR_Msk                       _U_(0x00000007)                                      /**< (SFR_OHCIISR) Register Mask  */

#define SFR_OHCIISR_RIS_Pos                   _U_(0)                                               /**< (SFR_OHCIISR Position) OHCI Resume Interrupt Status Port 2 */
#define SFR_OHCIISR_RIS_Msk                   (_U_(0x7) << SFR_OHCIISR_RIS_Pos)                    /**< (SFR_OHCIISR Mask) RIS */
#define SFR_OHCIISR_RIS(value)                (SFR_OHCIISR_RIS_Msk & ((value) << SFR_OHCIISR_RIS_Pos)) 

/* -------- SFR_BU_OTPC_CONF_R0 : (SFR Offset: 0x18) (R/W 32) OTPC Configuration 0 Register (BackUp) -------- */
#define SFR_BU_OTPC_CONF_R0_ROM_READ_Pos      _U_(0)                                               /**< (SFR_BU_OTPC_CONF_R0) Reading of ROM (OTP part only) Position */
#define SFR_BU_OTPC_CONF_R0_ROM_READ_Msk      (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ROM_READ_Pos)       /**< (SFR_BU_OTPC_CONF_R0) Reading of ROM (OTP part only) Mask */
#define SFR_BU_OTPC_CONF_R0_ROM_READ(value)   (SFR_BU_OTPC_CONF_R0_ROM_READ_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ROM_READ_Pos))
#define   SFR_BU_OTPC_CONF_R0_ROM_READ_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the ROM (OTP part only).  */
#define   SFR_BU_OTPC_CONF_R0_ROM_READ_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the ROM (OTP part only).  */
#define SFR_BU_OTPC_CONF_R0_ROM_READ_ENABLE   (SFR_BU_OTPC_CONF_R0_ROM_READ_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ROM_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the ROM (OTP part only). Position  */
#define SFR_BU_OTPC_CONF_R0_ROM_READ_DISABLE  (SFR_BU_OTPC_CONF_R0_ROM_READ_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ROM_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the ROM (OTP part only). Position  */
#define SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_Pos   _U_(1)                                               /**< (SFR_BU_OTPC_CONF_R0) Programming of ROM (OTP part only) Position */
#define SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_Msk   (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_Pos)    /**< (SFR_BU_OTPC_CONF_R0) Programming of ROM (OTP part only) Mask */
#define SFR_BU_OTPC_CONF_R0_ROM_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the ROM (OTP part only).  */
#define   SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the ROM (OTP part only).  */
#define SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the ROM (OTP part only). Position  */
#define SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ROM_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the ROM (OTP part only). Position  */
#define SFR_BU_OTPC_CONF_R0_PU_READ_Pos       _U_(2)                                               /**< (SFR_BU_OTPC_CONF_R0) Reading of Patch Unit Position */
#define SFR_BU_OTPC_CONF_R0_PU_READ_Msk       (_U_(0x1) << SFR_BU_OTPC_CONF_R0_PU_READ_Pos)        /**< (SFR_BU_OTPC_CONF_R0) Reading of Patch Unit Mask */
#define SFR_BU_OTPC_CONF_R0_PU_READ(value)    (SFR_BU_OTPC_CONF_R0_PU_READ_Msk & ((value) << SFR_BU_OTPC_CONF_R0_PU_READ_Pos))
#define   SFR_BU_OTPC_CONF_R0_PU_READ_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the patch unit.  */
#define   SFR_BU_OTPC_CONF_R0_PU_READ_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the patch unit.  */
#define SFR_BU_OTPC_CONF_R0_PU_READ_ENABLE    (SFR_BU_OTPC_CONF_R0_PU_READ_ENABLE_Val << SFR_BU_OTPC_CONF_R0_PU_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the patch unit. Position  */
#define SFR_BU_OTPC_CONF_R0_PU_READ_DISABLE   (SFR_BU_OTPC_CONF_R0_PU_READ_DISABLE_Val << SFR_BU_OTPC_CONF_R0_PU_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the patch unit. Position  */
#define SFR_BU_OTPC_CONF_R0_PU_PROGRAM_Pos    _U_(3)                                               /**< (SFR_BU_OTPC_CONF_R0) Programming of Patch Unit Position */
#define SFR_BU_OTPC_CONF_R0_PU_PROGRAM_Msk    (_U_(0x1) << SFR_BU_OTPC_CONF_R0_PU_PROGRAM_Pos)     /**< (SFR_BU_OTPC_CONF_R0) Programming of Patch Unit Mask */
#define SFR_BU_OTPC_CONF_R0_PU_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_PU_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_PU_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_PU_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the patch unit.  */
#define   SFR_BU_OTPC_CONF_R0_PU_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the patch unit.  */
#define SFR_BU_OTPC_CONF_R0_PU_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_PU_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_PU_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the patch unit. Position  */
#define SFR_BU_OTPC_CONF_R0_PU_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_PU_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_PU_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the patch unit. Position  */
#define SFR_BU_OTPC_CONF_R0_ENGI_READ_Pos     _U_(4)                                               /**< (SFR_BU_OTPC_CONF_R0) Reading of Engineering Area Position */
#define SFR_BU_OTPC_CONF_R0_ENGI_READ_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ENGI_READ_Pos)      /**< (SFR_BU_OTPC_CONF_R0) Reading of Engineering Area Mask */
#define SFR_BU_OTPC_CONF_R0_ENGI_READ(value)  (SFR_BU_OTPC_CONF_R0_ENGI_READ_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ENGI_READ_Pos))
#define   SFR_BU_OTPC_CONF_R0_ENGI_READ_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the engineering area.  */
#define   SFR_BU_OTPC_CONF_R0_ENGI_READ_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the engineering area.  */
#define SFR_BU_OTPC_CONF_R0_ENGI_READ_ENABLE  (SFR_BU_OTPC_CONF_R0_ENGI_READ_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ENGI_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the engineering area. Position  */
#define SFR_BU_OTPC_CONF_R0_ENGI_READ_DISABLE (SFR_BU_OTPC_CONF_R0_ENGI_READ_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ENGI_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the engineering area. Position  */
#define SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_Pos  _U_(5)                                               /**< (SFR_BU_OTPC_CONF_R0) Programming of Engineering Area Position */
#define SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_Msk  (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_Pos)   /**< (SFR_BU_OTPC_CONF_R0) Programming of Engineering Area Mask */
#define SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the engineering area.  */
#define   SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the engineering area.  */
#define SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the engineering area. Position  */
#define SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ENGI_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the engineering area. Position  */
#define SFR_BU_OTPC_CONF_R0_USER_READ_Pos     _U_(6)                                               /**< (SFR_BU_OTPC_CONF_R0) Reading of User Area Position */
#define SFR_BU_OTPC_CONF_R0_USER_READ_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R0_USER_READ_Pos)      /**< (SFR_BU_OTPC_CONF_R0) Reading of User Area Mask */
#define SFR_BU_OTPC_CONF_R0_USER_READ(value)  (SFR_BU_OTPC_CONF_R0_USER_READ_Msk & ((value) << SFR_BU_OTPC_CONF_R0_USER_READ_Pos))
#define   SFR_BU_OTPC_CONF_R0_USER_READ_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the user area.  */
#define   SFR_BU_OTPC_CONF_R0_USER_READ_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the user area.  */
#define SFR_BU_OTPC_CONF_R0_USER_READ_ENABLE  (SFR_BU_OTPC_CONF_R0_USER_READ_ENABLE_Val << SFR_BU_OTPC_CONF_R0_USER_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables reading of the user area. Position  */
#define SFR_BU_OTPC_CONF_R0_USER_READ_DISABLE (SFR_BU_OTPC_CONF_R0_USER_READ_DISABLE_Val << SFR_BU_OTPC_CONF_R0_USER_READ_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables reading of the user area. Position  */
#define SFR_BU_OTPC_CONF_R0_USER_PROGRAM_Pos  _U_(7)                                               /**< (SFR_BU_OTPC_CONF_R0) Programming of User Area Position */
#define SFR_BU_OTPC_CONF_R0_USER_PROGRAM_Msk  (_U_(0x1) << SFR_BU_OTPC_CONF_R0_USER_PROGRAM_Pos)   /**< (SFR_BU_OTPC_CONF_R0) Programming of User Area Mask */
#define SFR_BU_OTPC_CONF_R0_USER_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_USER_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_USER_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_USER_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the user area.  */
#define   SFR_BU_OTPC_CONF_R0_USER_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the user area.  */
#define SFR_BU_OTPC_CONF_R0_USER_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_USER_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_USER_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the user area. Position  */
#define SFR_BU_OTPC_CONF_R0_USER_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_USER_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_USER_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the user area. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_Pos _U_(8)                                               /**< (SFR_BU_OTPC_CONF_R0) Invalidation of Product UID Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Invalidation of Product UID Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE(value) (SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the Product UID special packet.  */
#define   SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the Product UID special packet.  */
#define SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_LOCK_Pos     _U_(9)                                               /**< (SFR_BU_OTPC_CONF_R0) Lock of Product UID Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_PUID_LOCK_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R0_PUID_LOCK_Pos)      /**< (SFR_BU_OTPC_CONF_R0) Lock of Product UID Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_PUID_LOCK(value)  (SFR_BU_OTPC_CONF_R0_PUID_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R0_PUID_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R0_PUID_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the Product UID special packet.  */
#define   SFR_BU_OTPC_CONF_R0_PUID_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the Product UID special packet.  */
#define SFR_BU_OTPC_CONF_R0_PUID_LOCK_ENABLE  (SFR_BU_OTPC_CONF_R0_PUID_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_LOCK_DISABLE (SFR_BU_OTPC_CONF_R0_PUID_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_PARSE_Pos    _U_(10)                                              /**< (SFR_BU_OTPC_CONF_R0) Parsing of Product UID Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_PUID_PARSE_Msk    (_U_(0x1) << SFR_BU_OTPC_CONF_R0_PUID_PARSE_Pos)     /**< (SFR_BU_OTPC_CONF_R0) Parsing of Product UID Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_PUID_PARSE(value) (SFR_BU_OTPC_CONF_R0_PUID_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_PUID_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R0_PUID_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the Product UID special packet.  */
#define   SFR_BU_OTPC_CONF_R0_PUID_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the Product UID special packet.  */
#define SFR_BU_OTPC_CONF_R0_PUID_PARSE_ENABLE (SFR_BU_OTPC_CONF_R0_PUID_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_PARSE_DISABLE (SFR_BU_OTPC_CONF_R0_PUID_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_Pos  _U_(11)                                              /**< (SFR_BU_OTPC_CONF_R0) Programming of Product UID Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_Msk  (_U_(0x1) << SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_Pos)   /**< (SFR_BU_OTPC_CONF_R0) Programming of Product UID Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_PUID_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the Product UID special packet.  */
#define   SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the Product UID special packet.  */
#define SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_PUID_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the Product UID special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_Pos _U_(12)                                              /**< (SFR_BU_OTPC_CONF_R0) Invalidation of Engineering Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Invalidation of Engineering Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE(value) (SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the Engineering Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the Engineering Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_LOCK_Pos      _U_(13)                                              /**< (SFR_BU_OTPC_CONF_R0) Lock of Engineering Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_EHC_LOCK_Msk      (_U_(0x1) << SFR_BU_OTPC_CONF_R0_EHC_LOCK_Pos)       /**< (SFR_BU_OTPC_CONF_R0) Lock of Engineering Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_EHC_LOCK(value)   (SFR_BU_OTPC_CONF_R0_EHC_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R0_EHC_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R0_EHC_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the Engineering Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_EHC_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the Engineering Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_EHC_LOCK_ENABLE   (SFR_BU_OTPC_CONF_R0_EHC_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_LOCK_DISABLE  (SFR_BU_OTPC_CONF_R0_EHC_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_PARSE_Pos     _U_(14)                                              /**< (SFR_BU_OTPC_CONF_R0) Parsing of Engineering Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_EHC_PARSE_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R0_EHC_PARSE_Pos)      /**< (SFR_BU_OTPC_CONF_R0) Parsing of Engineering Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_EHC_PARSE(value)  (SFR_BU_OTPC_CONF_R0_EHC_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_EHC_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R0_EHC_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the Engineering Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_EHC_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the Engineering Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_EHC_PARSE_ENABLE  (SFR_BU_OTPC_CONF_R0_EHC_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_PARSE_DISABLE (SFR_BU_OTPC_CONF_R0_EHC_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_Pos   _U_(15)                                              /**< (SFR_BU_OTPC_CONF_R0) Programming of Engineering Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_Msk   (_U_(0x1) << SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_Pos)    /**< (SFR_BU_OTPC_CONF_R0) Programming of Engineering Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_EHC_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the Engineering Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the Engineering Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_EHC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the Engineering Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_Pos _U_(16)                                              /**< (SFR_BU_OTPC_CONF_R0) Invalidation of Engineering Security Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Invalidation of Engineering Security Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE(value) (SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the Engineering Security Configuration special packet.  */
