Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
#define   SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the Engineering Security Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_LOCK_Pos      _U_(17)                                              /**< (SFR_BU_OTPC_CONF_R0) Lock of Engineering Security Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_ESC_LOCK_Msk      (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ESC_LOCK_Pos)       /**< (SFR_BU_OTPC_CONF_R0) Lock of Engineering Security Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_ESC_LOCK(value)   (SFR_BU_OTPC_CONF_R0_ESC_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ESC_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R0_ESC_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the Engineering Security Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_ESC_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the Engineering Security Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_ESC_LOCK_ENABLE   (SFR_BU_OTPC_CONF_R0_ESC_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_LOCK_DISABLE  (SFR_BU_OTPC_CONF_R0_ESC_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_PARSE_Pos     _U_(18)                                              /**< (SFR_BU_OTPC_CONF_R0) Parsing of Engineering Security Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_ESC_PARSE_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ESC_PARSE_Pos)      /**< (SFR_BU_OTPC_CONF_R0) Parsing of Engineering Security Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_ESC_PARSE(value)  (SFR_BU_OTPC_CONF_R0_ESC_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ESC_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R0_ESC_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the Engineering Security Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_ESC_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the Engineering Security Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_ESC_PARSE_ENABLE  (SFR_BU_OTPC_CONF_R0_ESC_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_PARSE_DISABLE (SFR_BU_OTPC_CONF_R0_ESC_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_Pos   _U_(19)                                              /**< (SFR_BU_OTPC_CONF_R0) Programming of Engineering Security Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_Msk   (_U_(0x1) << SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_Pos)    /**< (SFR_BU_OTPC_CONF_R0) Programming of Engineering Security Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_ESC_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the Engineering Security Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the Engineering Security Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_ESC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the Engineering Security Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_Pos _U_(20)                                              /**< (SFR_BU_OTPC_CONF_R0) Invalidation of User Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Invalidation of User Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE(value) (SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the User Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the User Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_LOCK_Pos      _U_(21)                                              /**< (SFR_BU_OTPC_CONF_R0) Lock of User Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_UHC_LOCK_Msk      (_U_(0x1) << SFR_BU_OTPC_CONF_R0_UHC_LOCK_Pos)       /**< (SFR_BU_OTPC_CONF_R0) Lock of User Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_UHC_LOCK(value)   (SFR_BU_OTPC_CONF_R0_UHC_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R0_UHC_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R0_UHC_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the User Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_UHC_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the User Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_UHC_LOCK_ENABLE   (SFR_BU_OTPC_CONF_R0_UHC_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_LOCK_DISABLE  (SFR_BU_OTPC_CONF_R0_UHC_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_PARSE_Pos     _U_(22)                                              /**< (SFR_BU_OTPC_CONF_R0) Parsing of User Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_UHC_PARSE_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R0_UHC_PARSE_Pos)      /**< (SFR_BU_OTPC_CONF_R0) Parsing of User Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_UHC_PARSE(value)  (SFR_BU_OTPC_CONF_R0_UHC_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_UHC_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R0_UHC_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the User Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_UHC_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the User Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_UHC_PARSE_ENABLE  (SFR_BU_OTPC_CONF_R0_UHC_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_PARSE_DISABLE (SFR_BU_OTPC_CONF_R0_UHC_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_Pos   _U_(23)                                              /**< (SFR_BU_OTPC_CONF_R0) Programming of User Hardware Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_Msk   (_U_(0x1) << SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_Pos)    /**< (SFR_BU_OTPC_CONF_R0) Programming of User Hardware Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_UHC_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the User Hardware Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the User Hardware Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_UHC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the User Hardware Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_Pos _U_(24)                                              /**< (SFR_BU_OTPC_CONF_R0) Invalidation of User Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_Pos)  /**< (SFR_BU_OTPC_CONF_R0) Invalidation of User Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_BC_INVALIDATE(value) (SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the User Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the User Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_BC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_LOCK_Pos       _U_(25)                                              /**< (SFR_BU_OTPC_CONF_R0) Lock of User Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_BC_LOCK_Msk       (_U_(0x1) << SFR_BU_OTPC_CONF_R0_BC_LOCK_Pos)        /**< (SFR_BU_OTPC_CONF_R0) Lock of User Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_BC_LOCK(value)    (SFR_BU_OTPC_CONF_R0_BC_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R0_BC_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R0_BC_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the User Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_BC_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the User Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_BC_LOCK_ENABLE    (SFR_BU_OTPC_CONF_R0_BC_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R0_BC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_LOCK_DISABLE   (SFR_BU_OTPC_CONF_R0_BC_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R0_BC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_PARSE_Pos      _U_(26)                                              /**< (SFR_BU_OTPC_CONF_R0) Parsing of User Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_BC_PARSE_Msk      (_U_(0x1) << SFR_BU_OTPC_CONF_R0_BC_PARSE_Pos)       /**< (SFR_BU_OTPC_CONF_R0) Parsing of User Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_BC_PARSE(value)   (SFR_BU_OTPC_CONF_R0_BC_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_BC_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R0_BC_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the User Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_BC_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the User Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_BC_PARSE_ENABLE   (SFR_BU_OTPC_CONF_R0_BC_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_BC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_PARSE_DISABLE  (SFR_BU_OTPC_CONF_R0_BC_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_BC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_PROGRAM_Pos    _U_(27)                                              /**< (SFR_BU_OTPC_CONF_R0) Programming of User Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_BC_PROGRAM_Msk    (_U_(0x1) << SFR_BU_OTPC_CONF_R0_BC_PROGRAM_Pos)     /**< (SFR_BU_OTPC_CONF_R0) Programming of User Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_BC_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_BC_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_BC_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_BC_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the User Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_BC_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the User Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_BC_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_BC_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_BC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_BC_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_BC_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_BC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the User Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_Pos _U_(28)                                              /**< (SFR_BU_OTPC_CONF_R0) Invalidation of User Secure Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Invalidation of User Secure Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE(value) (SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the User Secure Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the User Secure Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables invalidation of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables invalidation of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_LOCK_Pos      _U_(29)                                              /**< (SFR_BU_OTPC_CONF_R0) Lock of User Secure Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_SBD_LOCK_Msk      (_U_(0x1) << SFR_BU_OTPC_CONF_R0_SBD_LOCK_Pos)       /**< (SFR_BU_OTPC_CONF_R0) Lock of User Secure Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_SBD_LOCK(value)   (SFR_BU_OTPC_CONF_R0_SBD_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R0_SBD_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R0_SBD_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the User Secure Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_SBD_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the User Secure Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_SBD_LOCK_ENABLE   (SFR_BU_OTPC_CONF_R0_SBD_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables lock of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_LOCK_DISABLE  (SFR_BU_OTPC_CONF_R0_SBD_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables lock of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_PARSE_Pos     _U_(30)                                              /**< (SFR_BU_OTPC_CONF_R0) Parsing of User Secure Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_SBD_PARSE_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R0_SBD_PARSE_Pos)      /**< (SFR_BU_OTPC_CONF_R0) Parsing of User Secure Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_SBD_PARSE(value)  (SFR_BU_OTPC_CONF_R0_SBD_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R0_SBD_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R0_SBD_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the User Secure Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_SBD_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the User Secure Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_SBD_PARSE_ENABLE  (SFR_BU_OTPC_CONF_R0_SBD_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables parsing of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_PARSE_DISABLE (SFR_BU_OTPC_CONF_R0_SBD_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables parsing of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_Pos   _U_(31)                                              /**< (SFR_BU_OTPC_CONF_R0) Programming of User Secure Boot Configuration Special Packet Position */
#define SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_Msk   (_U_(0x1) << SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_Pos)    /**< (SFR_BU_OTPC_CONF_R0) Programming of User Secure Boot Configuration Special Packet Mask */
#define SFR_BU_OTPC_CONF_R0_SBD_PROGRAM(value) (SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the User Secure Boot Configuration special packet.  */
#define   SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the User Secure Boot Configuration special packet.  */
#define SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Enables programming of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R0_SBD_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R0) Disables programming of the User Secure Boot Configuration special packet. Position  */
#define SFR_BU_OTPC_CONF_R0_Msk               _U_(0xFFFFFFFF)                                      /**< (SFR_BU_OTPC_CONF_R0) Register Mask  */


