Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/* -------- SFR_BU_OTPC_CONF_R1 : (SFR Offset: 0x1C) (R/W 32) OTPC Configuration 1 Register (BackUp) -------- */
#define SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_Pos _U_(0)                                               /**< (SFR_BU_OTPC_CONF_R1) Invalidation of User Custom Special Packet (Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_Pos)  /**< (SFR_BU_OTPC_CONF_R1) Invalidation of User Custom Special Packet (Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_SC_INVALIDATE(value) (SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables invalidation of the User Custom special packet (for Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables invalidation of the User Custom special packet (for Secure World).  */
#define SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables invalidation of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R1_SC_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables invalidation of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_SC_LOCK_Pos       _U_(1)                                               /**< (SFR_BU_OTPC_CONF_R1) Lock of User Custom Special Packet (Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_SC_LOCK_Msk       (_U_(0x1) << SFR_BU_OTPC_CONF_R1_SC_LOCK_Pos)        /**< (SFR_BU_OTPC_CONF_R1) Lock of User Custom Special Packet (Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_SC_LOCK(value)    (SFR_BU_OTPC_CONF_R1_SC_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R1_SC_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R1_SC_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables lock of the User Custom special packet (for Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_SC_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables lock of the User Custom special packet (for Secure World).  */
#define SFR_BU_OTPC_CONF_R1_SC_LOCK_ENABLE    (SFR_BU_OTPC_CONF_R1_SC_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R1_SC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables lock of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_SC_LOCK_DISABLE   (SFR_BU_OTPC_CONF_R1_SC_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R1_SC_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables lock of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_SC_PARSE_Pos      _U_(2)                                               /**< (SFR_BU_OTPC_CONF_R1) Parsing of the User Custom Special Packet (Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_SC_PARSE_Msk      (_U_(0x1) << SFR_BU_OTPC_CONF_R1_SC_PARSE_Pos)       /**< (SFR_BU_OTPC_CONF_R1) Parsing of the User Custom Special Packet (Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_SC_PARSE(value)   (SFR_BU_OTPC_CONF_R1_SC_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R1_SC_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R1_SC_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables parsing of the User Custom special packet (for Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_SC_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables parsing of the User Custom special packet (for Secure World).  */
#define SFR_BU_OTPC_CONF_R1_SC_PARSE_ENABLE   (SFR_BU_OTPC_CONF_R1_SC_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R1_SC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables parsing of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_SC_PARSE_DISABLE  (SFR_BU_OTPC_CONF_R1_SC_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R1_SC_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables parsing of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_SC_PROGRAM_Pos    _U_(3)                                               /**< (SFR_BU_OTPC_CONF_R1) Programming of User Custom Special Packet (Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_SC_PROGRAM_Msk    (_U_(0x1) << SFR_BU_OTPC_CONF_R1_SC_PROGRAM_Pos)     /**< (SFR_BU_OTPC_CONF_R1) Programming of User Custom Special Packet (Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_SC_PROGRAM(value) (SFR_BU_OTPC_CONF_R1_SC_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R1_SC_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R1_SC_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables programming of the User Custom special packet (for Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_SC_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables programming of the User Custom special packet (for Secure World).  */
#define SFR_BU_OTPC_CONF_R1_SC_PROGRAM_ENABLE (SFR_BU_OTPC_CONF_R1_SC_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R1_SC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables programming of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_SC_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R1_SC_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R1_SC_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables programming of the User Custom special packet (for Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_INVALIDATE_Pos  _U_(4)                                               /**< (SFR_BU_OTPC_CONF_R1) Invalidation of User Custom Special Packet (Non-Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_C_INVALIDATE_Msk  (_U_(0x1) << SFR_BU_OTPC_CONF_R1_C_INVALIDATE_Pos)   /**< (SFR_BU_OTPC_CONF_R1) Invalidation of User Custom Special Packet (Non-Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_C_INVALIDATE(value) (SFR_BU_OTPC_CONF_R1_C_INVALIDATE_Msk & ((value) << SFR_BU_OTPC_CONF_R1_C_INVALIDATE_Pos))
#define   SFR_BU_OTPC_CONF_R1_C_INVALIDATE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables invalidation of the User Custom special packet (for Non-Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_C_INVALIDATE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables invalidation of the User Custom special packet (for Non-Secure World).  */
#define SFR_BU_OTPC_CONF_R1_C_INVALIDATE_ENABLE (SFR_BU_OTPC_CONF_R1_C_INVALIDATE_ENABLE_Val << SFR_BU_OTPC_CONF_R1_C_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables invalidation of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_INVALIDATE_DISABLE (SFR_BU_OTPC_CONF_R1_C_INVALIDATE_DISABLE_Val << SFR_BU_OTPC_CONF_R1_C_INVALIDATE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables invalidation of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_LOCK_Pos        _U_(5)                                               /**< (SFR_BU_OTPC_CONF_R1) Lock of User Custom Special Packet (Non-Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_C_LOCK_Msk        (_U_(0x1) << SFR_BU_OTPC_CONF_R1_C_LOCK_Pos)         /**< (SFR_BU_OTPC_CONF_R1) Lock of User Custom Special Packet (Non-Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_C_LOCK(value)     (SFR_BU_OTPC_CONF_R1_C_LOCK_Msk & ((value) << SFR_BU_OTPC_CONF_R1_C_LOCK_Pos))
#define   SFR_BU_OTPC_CONF_R1_C_LOCK_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables lock of the User Custom special packet (for Non-Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_C_LOCK_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables lock of the User Custom special packet (for Non-Secure World).  */
#define SFR_BU_OTPC_CONF_R1_C_LOCK_ENABLE     (SFR_BU_OTPC_CONF_R1_C_LOCK_ENABLE_Val << SFR_BU_OTPC_CONF_R1_C_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables lock of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_LOCK_DISABLE    (SFR_BU_OTPC_CONF_R1_C_LOCK_DISABLE_Val << SFR_BU_OTPC_CONF_R1_C_LOCK_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables lock of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_PARSE_Pos       _U_(6)                                               /**< (SFR_BU_OTPC_CONF_R1) Parsing of User Custom Special Packet (Non-Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_C_PARSE_Msk       (_U_(0x1) << SFR_BU_OTPC_CONF_R1_C_PARSE_Pos)        /**< (SFR_BU_OTPC_CONF_R1) Parsing of User Custom Special Packet (Non-Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_C_PARSE(value)    (SFR_BU_OTPC_CONF_R1_C_PARSE_Msk & ((value) << SFR_BU_OTPC_CONF_R1_C_PARSE_Pos))
#define   SFR_BU_OTPC_CONF_R1_C_PARSE_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables parsing of the User Custom special packet (for Non-Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_C_PARSE_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables parsing of the User Custom special packet (for Non-Secure World).  */
#define SFR_BU_OTPC_CONF_R1_C_PARSE_ENABLE    (SFR_BU_OTPC_CONF_R1_C_PARSE_ENABLE_Val << SFR_BU_OTPC_CONF_R1_C_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables parsing of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_PARSE_DISABLE   (SFR_BU_OTPC_CONF_R1_C_PARSE_DISABLE_Val << SFR_BU_OTPC_CONF_R1_C_PARSE_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables parsing of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_PROGRAM_Pos     _U_(7)                                               /**< (SFR_BU_OTPC_CONF_R1) Programming of User Custom Special Packet (Non-Secure World) Position */
#define SFR_BU_OTPC_CONF_R1_C_PROGRAM_Msk     (_U_(0x1) << SFR_BU_OTPC_CONF_R1_C_PROGRAM_Pos)      /**< (SFR_BU_OTPC_CONF_R1) Programming of User Custom Special Packet (Non-Secure World) Mask */
#define SFR_BU_OTPC_CONF_R1_C_PROGRAM(value)  (SFR_BU_OTPC_CONF_R1_C_PROGRAM_Msk & ((value) << SFR_BU_OTPC_CONF_R1_C_PROGRAM_Pos))
#define   SFR_BU_OTPC_CONF_R1_C_PROGRAM_ENABLE_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Enables programming of the User Custom special packet (for Non-Secure World).  */
#define   SFR_BU_OTPC_CONF_R1_C_PROGRAM_DISABLE_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Disables programming of the User Custom special packet (for Non-Secure World).  */
#define SFR_BU_OTPC_CONF_R1_C_PROGRAM_ENABLE  (SFR_BU_OTPC_CONF_R1_C_PROGRAM_ENABLE_Val << SFR_BU_OTPC_CONF_R1_C_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R1) Enables programming of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_C_PROGRAM_DISABLE (SFR_BU_OTPC_CONF_R1_C_PROGRAM_DISABLE_Val << SFR_BU_OTPC_CONF_R1_C_PROGRAM_Pos) /**< (SFR_BU_OTPC_CONF_R1) Disables programming of the User Custom special packet (for Non-Secure World). Position  */
#define SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_Pos  _U_(8)                                               /**< (SFR_BU_OTPC_CONF_R1) Engineering Area Refresh Position */
#define SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_Msk  (_U_(0x1) << SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_Pos)   /**< (SFR_BU_OTPC_CONF_R1) Engineering Area Refresh Mask */
#define SFR_BU_OTPC_CONF_R1_ENGI_REFRESH(value) (SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_Msk & ((value) << SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_Pos))
#define   SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_ALLOWED_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Allows refresh of the Engineering Area.  */
#define   SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_FORBIDDEN_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Forbids refresh of the Engineering Area.  */
#define SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_ALLOWED (SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_ALLOWED_Val << SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_Pos) /**< (SFR_BU_OTPC_CONF_R1) Allows refresh of the Engineering Area. Position  */
#define SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_FORBIDDEN (SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_FORBIDDEN_Val << SFR_BU_OTPC_CONF_R1_ENGI_REFRESH_Pos) /**< (SFR_BU_OTPC_CONF_R1) Forbids refresh of the Engineering Area. Position  */
#define SFR_BU_OTPC_CONF_R1_USER_REFRESH_Pos  _U_(9)                                               /**< (SFR_BU_OTPC_CONF_R1) User Area Refresh Position */
#define SFR_BU_OTPC_CONF_R1_USER_REFRESH_Msk  (_U_(0x1) << SFR_BU_OTPC_CONF_R1_USER_REFRESH_Pos)   /**< (SFR_BU_OTPC_CONF_R1) User Area Refresh Mask */
#define SFR_BU_OTPC_CONF_R1_USER_REFRESH(value) (SFR_BU_OTPC_CONF_R1_USER_REFRESH_Msk & ((value) << SFR_BU_OTPC_CONF_R1_USER_REFRESH_Pos))
#define   SFR_BU_OTPC_CONF_R1_USER_REFRESH_ALLOWED_Val _U_(0x0)                                             /**< (SFR_BU_OTPC_CONF_R1) Allows refresh of the User Area.  */
#define   SFR_BU_OTPC_CONF_R1_USER_REFRESH_FORBIDDEN_Val _U_(0x1)                                             /**< (SFR_BU_OTPC_CONF_R1) Forbids refresh of the User Area.  */
#define SFR_BU_OTPC_CONF_R1_USER_REFRESH_ALLOWED (SFR_BU_OTPC_CONF_R1_USER_REFRESH_ALLOWED_Val << SFR_BU_OTPC_CONF_R1_USER_REFRESH_Pos) /**< (SFR_BU_OTPC_CONF_R1) Allows refresh of the User Area. Position  */
#define SFR_BU_OTPC_CONF_R1_USER_REFRESH_FORBIDDEN (SFR_BU_OTPC_CONF_R1_USER_REFRESH_FORBIDDEN_Val << SFR_BU_OTPC_CONF_R1_USER_REFRESH_Pos) /**< (SFR_BU_OTPC_CONF_R1) Forbids refresh of the User Area. Position  */
#define SFR_BU_OTPC_CONF_R1_FROM_SFRBU_ONLY_Pos _U_(24)                                              /**< (SFR_BU_OTPC_CONF_R1) OTPC Configuration Signal Position */
#define SFR_BU_OTPC_CONF_R1_FROM_SFRBU_ONLY_Msk (_U_(0x1) << SFR_BU_OTPC_CONF_R1_FROM_SFRBU_ONLY_Pos) /**< (SFR_BU_OTPC_CONF_R1) OTPC Configuration Signal Mask */
#define SFR_BU_OTPC_CONF_R1_FROM_SFRBU_ONLY(value) (SFR_BU_OTPC_CONF_R1_FROM_SFRBU_ONLY_Msk & ((value) << SFR_BU_OTPC_CONF_R1_FROM_SFRBU_ONLY_Pos))
#define SFR_BU_OTPC_CONF_R1_Msk               _U_(0x010003FF)                                      /**< (SFR_BU_OTPC_CONF_R1) Register Mask  */


/* -------- SFR_BU_RC_XTAL_TRIM : (SFR Offset: 0x20) (R/W 32) RC and XTAL Oscillator Trimming Register (BackUp) -------- */
#define SFR_BU_RC_XTAL_TRIM_XTAL_TRIM_Pos     _U_(0)                                               /**< (SFR_BU_RC_XTAL_TRIM) 32.768 kHz Crystal Oscillator Trimming Value Position */
#define SFR_BU_RC_XTAL_TRIM_XTAL_TRIM_Msk     (_U_(0x3) << SFR_BU_RC_XTAL_TRIM_XTAL_TRIM_Pos)      /**< (SFR_BU_RC_XTAL_TRIM) 32.768 kHz Crystal Oscillator Trimming Value Mask */
#define SFR_BU_RC_XTAL_TRIM_XTAL_TRIM(value)  (SFR_BU_RC_XTAL_TRIM_XTAL_TRIM_Msk & ((value) << SFR_BU_RC_XTAL_TRIM_XTAL_TRIM_Pos))
#define SFR_BU_RC_XTAL_TRIM_XTAL_SEL_Pos      _U_(4)                                               /**< (SFR_BU_RC_XTAL_TRIM) 32.768 kHz Crystal Oscillator Trimming Select Position */
#define SFR_BU_RC_XTAL_TRIM_XTAL_SEL_Msk      (_U_(0x1) << SFR_BU_RC_XTAL_TRIM_XTAL_SEL_Pos)       /**< (SFR_BU_RC_XTAL_TRIM) 32.768 kHz Crystal Oscillator Trimming Select Mask */
#define SFR_BU_RC_XTAL_TRIM_XTAL_SEL(value)   (SFR_BU_RC_XTAL_TRIM_XTAL_SEL_Msk & ((value) << SFR_BU_RC_XTAL_TRIM_XTAL_SEL_Pos))
#define SFR_BU_RC_XTAL_TRIM_RC_TRIM_Pos       _U_(8)                                               /**< (SFR_BU_RC_XTAL_TRIM) 32 kHz RC Oscillator Trimming Value Position */
#define SFR_BU_RC_XTAL_TRIM_RC_TRIM_Msk       (_U_(0x7F) << SFR_BU_RC_XTAL_TRIM_RC_TRIM_Pos)       /**< (SFR_BU_RC_XTAL_TRIM) 32 kHz RC Oscillator Trimming Value Mask */
#define SFR_BU_RC_XTAL_TRIM_RC_TRIM(value)    (SFR_BU_RC_XTAL_TRIM_RC_TRIM_Msk & ((value) << SFR_BU_RC_XTAL_TRIM_RC_TRIM_Pos))
#define SFR_BU_RC_XTAL_TRIM_RC_SEL_Pos        _U_(15)                                              /**< (SFR_BU_RC_XTAL_TRIM) 32 kHz RC Oscillator Trimming Select Position */
#define SFR_BU_RC_XTAL_TRIM_RC_SEL_Msk        (_U_(0x1) << SFR_BU_RC_XTAL_TRIM_RC_SEL_Pos)         /**< (SFR_BU_RC_XTAL_TRIM) 32 kHz RC Oscillator Trimming Select Mask */
#define SFR_BU_RC_XTAL_TRIM_RC_SEL(value)     (SFR_BU_RC_XTAL_TRIM_RC_SEL_Msk & ((value) << SFR_BU_RC_XTAL_TRIM_RC_SEL_Pos))
#define SFR_BU_RC_XTAL_TRIM_Msk               _U_(0x0000FF13)                                      /**< (SFR_BU_RC_XTAL_TRIM) Register Mask  */


