Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/* -------- SFR_RM0 : (SFR Offset: 0x5C) (R/W 32) Read Margin0 Register -------- */
#define SFR_RM0_RM00_Pos                      _U_(0)                                               /**< (SFR_RM0) READ_MARGIN Value: i_bank0_msb_rf2p, i_bank0_lsb_rf2p, i_bank1_msb_rf2p, i_bank1_lsb_rf2p - 512 bytes (rf2p) - gfx2d_bank_rf2p_dc_32x32sw1 (GFX2D) Position */
#define SFR_RM0_RM00_Msk                      (_U_(0xF) << SFR_RM0_RM00_Pos)                       /**< (SFR_RM0) READ_MARGIN Value: i_bank0_msb_rf2p, i_bank0_lsb_rf2p, i_bank1_msb_rf2p, i_bank1_lsb_rf2p - 512 bytes (rf2p) - gfx2d_bank_rf2p_dc_32x32sw1 (GFX2D) Mask */
#define SFR_RM0_RM00(value)                   (SFR_RM0_RM00_Msk & ((value) << SFR_RM0_RM00_Pos))  
#define SFR_RM0_RM01_Pos                      _U_(4)                                               /**< (SFR_RM0) WRITE_MARGIN Value: i_bank0_msb_rf2p, i_bank0_lsb_rf2p, i_bank1_msb_rf2p, i_bank1_lsb_rf2p - 512 bytes (rf2p) - gfx2d_bank_rf2p_dc_32x32sw1 (GFX2D) Position */
#define SFR_RM0_RM01_Msk                      (_U_(0xF) << SFR_RM0_RM01_Pos)                       /**< (SFR_RM0) WRITE_MARGIN Value: i_bank0_msb_rf2p, i_bank0_lsb_rf2p, i_bank1_msb_rf2p, i_bank1_lsb_rf2p - 512 bytes (rf2p) - gfx2d_bank_rf2p_dc_32x32sw1 (GFX2D) Mask */
#define SFR_RM0_RM01(value)                   (SFR_RM0_RM01_Msk & ((value) << SFR_RM0_RM01_Pos))  
#define SFR_RM0_RM02_Pos                      _U_(8)                                               /**< (SFR_RM0) READ_MARGIN Value: i_clut_rf1p - 2 Kbytes (rf1p) - gfx2d_clut_rf_sc_512x32 (GFX2D) Position */
#define SFR_RM0_RM02_Msk                      (_U_(0xF) << SFR_RM0_RM02_Pos)                       /**< (SFR_RM0) READ_MARGIN Value: i_clut_rf1p - 2 Kbytes (rf1p) - gfx2d_clut_rf_sc_512x32 (GFX2D) Mask */
#define SFR_RM0_RM02(value)                   (SFR_RM0_RM02_Msk & ((value) << SFR_RM0_RM02_Pos))  
#define SFR_RM0_RM03_Pos                      _U_(12)                                              /**< (SFR_RM0) READ_MARGIN Value: i_queue_rf2p - 68 bytes (rf2p) - gfx2d_queue_rf2p_dc_8x68 (GFX2D) Position */
#define SFR_RM0_RM03_Msk                      (_U_(0xF) << SFR_RM0_RM03_Pos)                       /**< (SFR_RM0) READ_MARGIN Value: i_queue_rf2p - 68 bytes (rf2p) - gfx2d_queue_rf2p_dc_8x68 (GFX2D) Mask */
#define SFR_RM0_RM03(value)                   (SFR_RM0_RM03_Msk & ((value) << SFR_RM0_RM03_Pos))  
#define SFR_RM0_RM04_Pos                      _U_(16)                                              /**< (SFR_RM0) WRITE_MARGIN Value: i_queue_rf2p - 68 bytes (rf2p) - gfx2d_queue_rf2p_dc_8x68 (GFX2D) Position */
#define SFR_RM0_RM04_Msk                      (_U_(0xF) << SFR_RM0_RM04_Pos)                       /**< (SFR_RM0) WRITE_MARGIN Value: i_queue_rf2p - 68 bytes (rf2p) - gfx2d_queue_rf2p_dc_8x68 (GFX2D) Mask */
#define SFR_RM0_RM04(value)                   (SFR_RM0_RM04_Msk & ((value) << SFR_RM0_RM04_Pos))  
#define SFR_RM0_Msk                           _U_(0x000FFFFF)                                      /**< (SFR_RM0) Register Mask  */


/* -------- SFR_RM1 : (SFR Offset: 0x60) (R/W 32) Read Margin1 Register -------- */
#define SFR_RM1_RM10_Pos                      _U_(0)                                               /**< (SFR_RM1) READ_MARGIN Value: i_lcd_base_clut, i_lcd_heo_clut - 2 Kbytes (rf1p) - hlcdc_clut_rf_sc_256x32sw1 (HLCDC5) Position */
#define SFR_RM1_RM10_Msk                      (_U_(0xF) << SFR_RM1_RM10_Pos)                       /**< (SFR_RM1) READ_MARGIN Value: i_lcd_base_clut, i_lcd_heo_clut - 2 Kbytes (rf1p) - hlcdc_clut_rf_sc_256x32sw1 (HLCDC5) Mask */
#define SFR_RM1_RM10(value)                   (SFR_RM1_RM10_Msk & ((value) << SFR_RM1_RM10_Pos))  
#define SFR_RM1_RM11_Pos                      _U_(4)                                               /**< (SFR_RM1) READ_MARGIN Value: i_lcd_base_fifo, i_lcd_ovr1_rf2p, i_lcd_ovr2_rf2p, i_lcd_heo_fifo, i_lcd_heop1_fifo, i_lcd_heop2_fifo - 816 bytes (rf2p) - hlcdc_fifo_rf2p_dc_32x34 (HLCDC5) Position */
#define SFR_RM1_RM11_Msk                      (_U_(0xF) << SFR_RM1_RM11_Pos)                       /**< (SFR_RM1) READ_MARGIN Value: i_lcd_base_fifo, i_lcd_ovr1_rf2p, i_lcd_ovr2_rf2p, i_lcd_heo_fifo, i_lcd_heop1_fifo, i_lcd_heop2_fifo - 816 bytes (rf2p) - hlcdc_fifo_rf2p_dc_32x34 (HLCDC5) Mask */
#define SFR_RM1_RM11(value)                   (SFR_RM1_RM11_Msk & ((value) << SFR_RM1_RM11_Pos))  
#define SFR_RM1_RM12_Pos                      _U_(8)                                               /**< (SFR_RM1) WRITE_MARGIN Value: i_lcd_base_fifo, i_lcd_ovr1_rf2p, i_lcd_ovr2_rf2p, i_lcd_heo_fifo, i_lcd_heop1_fifo, i_lcd_heop2_fifo - 816 bytes (rf2p) - hlcdc_fifo_rf2p_dc_32x34 (HLCDC5) Position */
#define SFR_RM1_RM12_Msk                      (_U_(0xF) << SFR_RM1_RM12_Pos)                       /**< (SFR_RM1) WRITE_MARGIN Value: i_lcd_base_fifo, i_lcd_ovr1_rf2p, i_lcd_ovr2_rf2p, i_lcd_heo_fifo, i_lcd_heop1_fifo, i_lcd_heop2_fifo - 816 bytes (rf2p) - hlcdc_fifo_rf2p_dc_32x34 (HLCDC5) Mask */
#define SFR_RM1_RM12(value)                   (SFR_RM1_RM12_Msk & ((value) << SFR_RM1_RM12_Pos))  
#define SFR_RM1_RM13_Pos                      _U_(12)                                              /**< (SFR_RM1) READ_MARGIN Value: i_lcd_output_fifo - 1.5 Kbytes (rf2p) - hlcdc_fifo_rf2p_dc_512x24 (HLCDC5) Position */
#define SFR_RM1_RM13_Msk                      (_U_(0xF) << SFR_RM1_RM13_Pos)                       /**< (SFR_RM1) READ_MARGIN Value: i_lcd_output_fifo - 1.5 Kbytes (rf2p) - hlcdc_fifo_rf2p_dc_512x24 (HLCDC5) Mask */
#define SFR_RM1_RM13(value)                   (SFR_RM1_RM13_Msk & ((value) << SFR_RM1_RM13_Pos))  
#define SFR_RM1_RM14_Pos                      _U_(16)                                              /**< (SFR_RM1) WRITE_MARGIN Value: i_lcd_output_fifo - 1.5 Kbytes (rf2p) - hlcdc_fifo_rf2p_dc_512x24 (HLCDC5) Position */
#define SFR_RM1_RM14_Msk                      (_U_(0xF) << SFR_RM1_RM14_Pos)                       /**< (SFR_RM1) WRITE_MARGIN Value: i_lcd_output_fifo - 1.5 Kbytes (rf2p) - hlcdc_fifo_rf2p_dc_512x24 (HLCDC5) Mask */
#define SFR_RM1_RM14(value)                   (SFR_RM1_RM14_Msk & ((value) << SFR_RM1_RM14_Pos))  
#define SFR_RM1_RM15_Pos                      _U_(20)                                              /**< (SFR_RM1) READ_MARGIN Value: i_lcd_heo_scaler0, i_lcd_heo_scaler1, i_lcd_heo_scaler2 - 3 Kbytes (sram) hlcdc_heoscaler_sram_1024x24sw1 (HLCDC5) Position */
#define SFR_RM1_RM15_Msk                      (_U_(0xF) << SFR_RM1_RM15_Pos)                       /**< (SFR_RM1) READ_MARGIN Value: i_lcd_heo_scaler0, i_lcd_heo_scaler1, i_lcd_heo_scaler2 - 3 Kbytes (sram) hlcdc_heoscaler_sram_1024x24sw1 (HLCDC5) Mask */
#define SFR_RM1_RM15(value)                   (SFR_RM1_RM15_Msk & ((value) << SFR_RM1_RM15_Pos))  
#define SFR_RM1_RM16_Pos                      _U_(24)                                              /**< (SFR_RM1) READ_MARGIN Value: i_lcd_ovr1_sram, i_lcd_ovr2_sram - 2 Kbytes (sram) hlcdc_ovr_sram_256x32sw1 (HLCDC5) Position */
#define SFR_RM1_RM16_Msk                      (_U_(0xF) << SFR_RM1_RM16_Pos)                       /**< (SFR_RM1) READ_MARGIN Value: i_lcd_ovr1_sram, i_lcd_ovr2_sram - 2 Kbytes (sram) hlcdc_ovr_sram_256x32sw1 (HLCDC5) Mask */
#define SFR_RM1_RM16(value)                   (SFR_RM1_RM16_Msk & ((value) << SFR_RM1_RM16_Pos))  
#define SFR_RM1_RM17_Pos                      _U_(28)                                              /**< (SFR_RM1) READ_MARGIN Value: i_lcd_heo_cue0, i_lcd_heo_cue1 - 2 Kbytes (rf1p) - hlcdc_heocue_rf_sc_512x16sw1 (HLCDC5) Position */
#define SFR_RM1_RM17_Msk                      (_U_(0xF) << SFR_RM1_RM17_Pos)                       /**< (SFR_RM1) READ_MARGIN Value: i_lcd_heo_cue0, i_lcd_heo_cue1 - 2 Kbytes (rf1p) - hlcdc_heocue_rf_sc_512x16sw1 (HLCDC5) Mask */
#define SFR_RM1_RM17(value)                   (SFR_RM1_RM17_Msk & ((value) << SFR_RM1_RM17_Pos))  
#define SFR_RM1_Msk                           _U_(0xFFFFFFFF)                                      /**< (SFR_RM1) Register Mask  */


