Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/* -------- SFR_RM2 : (SFR Offset: 0x64) (R/W 32) Read Margin2 Register -------- */
#define SFR_RM2_RM20_Pos                      _U_(0)                                               /**< (SFR_RM2) READ-WRITE_MARGIN Value Port A: SDMMC0.i_dpram, SDMMC1.i_dpram - 2 Kbytes (dpsram) sdmmc_dpram_256x32sw1 (SDMMC) Position */
#define SFR_RM2_RM20_Msk                      (_U_(0xF) << SFR_RM2_RM20_Pos)                       /**< (SFR_RM2) READ-WRITE_MARGIN Value Port A: SDMMC0.i_dpram, SDMMC1.i_dpram - 2 Kbytes (dpsram) sdmmc_dpram_256x32sw1 (SDMMC) Mask */
#define SFR_RM2_RM20(value)                   (SFR_RM2_RM20_Msk & ((value) << SFR_RM2_RM20_Pos))  
#define SFR_RM2_RM21_Pos                      _U_(4)                                               /**< (SFR_RM2) READ-WRITE_MARGIN Value Port B SDMMC0.i_dpram, SDMMC1.i_dpram - 2 Kbytes (dpsram) sdmmc_dpram_256x32sw1 (SDMMC) Position */
#define SFR_RM2_RM21_Msk                      (_U_(0xF) << SFR_RM2_RM21_Pos)                       /**< (SFR_RM2) READ-WRITE_MARGIN Value Port B SDMMC0.i_dpram, SDMMC1.i_dpram - 2 Kbytes (dpsram) sdmmc_dpram_256x32sw1 (SDMMC) Mask */
#define SFR_RM2_RM21(value)                   (SFR_RM2_RM21_Msk & ((value) << SFR_RM2_RM21_Pos))  
#define SFR_RM2_RM22_Pos                      _U_(8)                                               /**< (SFR_RM2) READ-WRITE_MARGIN Value Port A: i_husb2dev_dpram_4112x32 - 16.5 Kbytes (dpsram) husb2dev_dpram_4224x32sw1 (HUSB) Position */
#define SFR_RM2_RM22_Msk                      (_U_(0xF) << SFR_RM2_RM22_Pos)                       /**< (SFR_RM2) READ-WRITE_MARGIN Value Port A: i_husb2dev_dpram_4112x32 - 16.5 Kbytes (dpsram) husb2dev_dpram_4224x32sw1 (HUSB) Mask */
#define SFR_RM2_RM22(value)                   (SFR_RM2_RM22_Msk & ((value) << SFR_RM2_RM22_Pos))  
#define SFR_RM2_RM23_Pos                      _U_(12)                                              /**< (SFR_RM2) READ-WRITE_MARGIN Value Port B: i_husb2dev_dpram_4112x32 - 16.5 Kbytes (dpsram) husb2dev_dpram_4224x32sw1 (HUSB) Position */
#define SFR_RM2_RM23_Msk                      (_U_(0xF) << SFR_RM2_RM23_Pos)                       /**< (SFR_RM2) READ-WRITE_MARGIN Value Port B: i_husb2dev_dpram_4112x32 - 16.5 Kbytes (dpsram) husb2dev_dpram_4224x32sw1 (HUSB) Mask */
#define SFR_RM2_RM23(value)                   (SFR_RM2_RM23_Msk & ((value) << SFR_RM2_RM23_Pos))  
#define SFR_RM2_Msk                           _U_(0x0000FFFF)                                      /**< (SFR_RM2) Register Mask  */


/* -------- SFR_RM3 : (SFR Offset: 0x68) (R/W 32) Read Margin3 Register -------- */
#define SFR_RM3_RM30_Pos                      _U_(0)                                               /**< (SFR_RM3) READ-WRITE_MARGIN Value Port A: i_dpram_1056x32 - 4.125 Kbytes (dpsram) hxdma_dpram_1056x32sw1 (HXDMA) Position */
#define SFR_RM3_RM30_Msk                      (_U_(0xF) << SFR_RM3_RM30_Pos)                       /**< (SFR_RM3) READ-WRITE_MARGIN Value Port A: i_dpram_1056x32 - 4.125 Kbytes (dpsram) hxdma_dpram_1056x32sw1 (HXDMA) Mask */
#define SFR_RM3_RM30(value)                   (SFR_RM3_RM30_Msk & ((value) << SFR_RM3_RM30_Pos))  
#define SFR_RM3_RM31_Pos                      _U_(4)                                               /**< (SFR_RM3) READ-WRITE_MARGIN Value Port B: i_dpram_1056x32 - 4.125 Kbytes (dpsram) hxdma_dpram_1056x32sw1 (HXDMA) Position */
#define SFR_RM3_RM31_Msk                      (_U_(0xF) << SFR_RM3_RM31_Pos)                       /**< (SFR_RM3) READ-WRITE_MARGIN Value Port B: i_dpram_1056x32 - 4.125 Kbytes (dpsram) hxdma_dpram_1056x32sw1 (HXDMA) Mask */
#define SFR_RM3_RM31(value)                   (SFR_RM3_RM31_Msk & ((value) << SFR_RM3_RM31_Pos))  
#define SFR_RM3_RM32_Pos                      _U_(8)                                               /**< (SFR_RM3) READ-WRITE_MARGIN Value: i_daram - 4 Kbytes (rf1p) - uhp_rf_sc_512x64 (EHCI/OHCI) Position */
#define SFR_RM3_RM32_Msk                      (_U_(0xF) << SFR_RM3_RM32_Pos)                       /**< (SFR_RM3) READ-WRITE_MARGIN Value: i_daram - 4 Kbytes (rf1p) - uhp_rf_sc_512x64 (EHCI/OHCI) Mask */
#define SFR_RM3_RM32(value)                   (SFR_RM3_RM32_Msk & ((value) << SFR_RM3_RM32_Pos))  
#define SFR_RM3_RM33_Pos                      _U_(12)                                              /**< (SFR_RM3) READ-WRITE_MARGIN Value: i_descram- 320 bytes (rf1p) - uhp_rf_sc_80x32 (EHCI/OHCI) Position */
#define SFR_RM3_RM33_Msk                      (_U_(0xF) << SFR_RM3_RM33_Pos)                       /**< (SFR_RM3) READ-WRITE_MARGIN Value: i_descram- 320 bytes (rf1p) - uhp_rf_sc_80x32 (EHCI/OHCI) Mask */
#define SFR_RM3_RM33(value)                   (SFR_RM3_RM33_Msk & ((value) << SFR_RM3_RM33_Pos))  
#define SFR_RM3_Msk                           _U_(0x0000FFFF)                                      /**< (SFR_RM3) Register Mask  */


/* -------- SFR_RM4 : (SFR Offset: 0x6C) (R/W 32) Read Margin4 Register -------- */
#define SFR_RM4_RM40_Pos                      _U_(0)                                               /**< (SFR_RM4) READ-WRITE_MARGIN Value: i_ahb_sram - 64 Kbytes (sram) - system_sram_16384x32sw1 (SRAM0) Position */
#define SFR_RM4_RM40_Msk                      (_U_(0xF) << SFR_RM4_RM40_Pos)                       /**< (SFR_RM4) READ-WRITE_MARGIN Value: i_ahb_sram - 64 Kbytes (sram) - system_sram_16384x32sw1 (SRAM0) Mask */
#define SFR_RM4_RM40(value)                   (SFR_RM4_RM40_Msk & ((value) << SFR_RM4_RM40_Pos))  
#define SFR_RM4_RM41_Pos                      _U_(4)                                               /**< (SFR_RM4) READ-WRITE_MARGIN Value: i_ahb_sram_otpc - 4 Kbytes (sram) - otpc_sram_1024x32sw1 (SRAM1 (OTPC)) Position */
#define SFR_RM4_RM41_Msk                      (_U_(0xF) << SFR_RM4_RM41_Pos)                       /**< (SFR_RM4) READ-WRITE_MARGIN Value: i_ahb_sram_otpc - 4 Kbytes (sram) - otpc_sram_1024x32sw1 (SRAM1 (OTPC)) Mask */
#define SFR_RM4_RM41(value)                   (SFR_RM4_RM41_Msk & ((value) << SFR_RM4_RM41_Pos))  
#define SFR_RM4_RM42_Pos                      _U_(8)                                               /**< (SFR_RM4) READ_MARGIN Value: i_rom_16384x32_sys - 64 Kbytes - (rom) - rom_system_rom_16384x32 (ROM) Position */
#define SFR_RM4_RM42_Msk                      (_U_(0xF) << SFR_RM4_RM42_Pos)                       /**< (SFR_RM4) READ_MARGIN Value: i_rom_16384x32_sys - 64 Kbytes - (rom) - rom_system_rom_16384x32 (ROM) Mask */
#define SFR_RM4_RM42(value)                   (SFR_RM4_RM42_Msk & ((value) << SFR_RM4_RM42_Pos))  
#define SFR_RM4_RM43_Pos                      _U_(12)                                              /**< (SFR_RM4) READ_MARGIN Value: i_rom_24576x32_ecc - 96 Kbytes - (rom) - rom_system_rom_24576x32 (ROM) Position */
#define SFR_RM4_RM43_Msk                      (_U_(0xF) << SFR_RM4_RM43_Pos)                       /**< (SFR_RM4) READ_MARGIN Value: i_rom_24576x32_ecc - 96 Kbytes - (rom) - rom_system_rom_24576x32 (ROM) Mask */
#define SFR_RM4_RM43(value)                   (SFR_RM4_RM43_Msk & ((value) << SFR_RM4_RM43_Pos))  
#define SFR_RM4_RM44_Pos                      _U_(16)                                              /**< (SFR_RM4) READ-WRITE_MARGIN Value: i_otpc_rf_sc_264x32sw1 - 1 Kbyte (rf1p) - otpc_rf_sc_264x32sw1 (OTPC) Position */
#define SFR_RM4_RM44_Msk                      (_U_(0xF) << SFR_RM4_RM44_Pos)                       /**< (SFR_RM4) READ-WRITE_MARGIN Value: i_otpc_rf_sc_264x32sw1 - 1 Kbyte (rf1p) - otpc_rf_sc_264x32sw1 (OTPC) Mask */
#define SFR_RM4_RM44(value)                   (SFR_RM4_RM44_Msk & ((value) << SFR_RM4_RM44_Pos))  
#define SFR_RM4_Msk                           _U_(0x000FFFFF)                                      /**< (SFR_RM4) Register Mask  */


