Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/* -------- SFR_RM5 : (SFR Offset: 0x70) (R/W 32) Read Margin5 Register -------- */
#define SFR_RM5_RM50_Pos                      _U_(0)                                               /**< (SFR_RM5) READ-WRITE_MARGIN Value: uICTagRam0, uICTagRam1, uICTagRam2, uICTagRam3 - 2.75 Kbytes (rf1p) - rf_256x22 (ARM926) Position */
#define SFR_RM5_RM50_Msk                      (_U_(0xF) << SFR_RM5_RM50_Pos)                       /**< (SFR_RM5) READ-WRITE_MARGIN Value: uICTagRam0, uICTagRam1, uICTagRam2, uICTagRam3 - 2.75 Kbytes (rf1p) - rf_256x22 (ARM926) Mask */
#define SFR_RM5_RM50(value)                   (SFR_RM5_RM50_Msk & ((value) << SFR_RM5_RM50_Pos))  
#define SFR_RM5_RM51_Pos                      _U_(4)                                               /**< (SFR_RM5) READ-WRITE_MARGIN Value: uICValidRam, uDCValidRam - 384 bytes (rf1p) - rf_64x24 (ARM926) Position */
#define SFR_RM5_RM51_Msk                      (_U_(0xF) << SFR_RM5_RM51_Pos)                       /**< (SFR_RM5) READ-WRITE_MARGIN Value: uICValidRam, uDCValidRam - 384 bytes (rf1p) - rf_64x24 (ARM926) Mask */
#define SFR_RM5_RM51(value)                   (SFR_RM5_RM51_Msk & ((value) << SFR_RM5_RM51_Pos))  
#define SFR_RM5_RM52_Pos                      _U_(8)                                               /**< (SFR_RM5) READ_MARGIN Value: uDCTagRam0, uDCTagRam1, uDCTagRam2, uDCTagRam3 - 5.5 Kbytes (rf1p) - rf_512x22 (ARM926) Position */
#define SFR_RM5_RM52_Msk                      (_U_(0xF) << SFR_RM5_RM52_Pos)                       /**< (SFR_RM5) READ_MARGIN Value: uDCTagRam0, uDCTagRam1, uDCTagRam2, uDCTagRam3 - 5.5 Kbytes (rf1p) - rf_512x22 (ARM926) Mask */
#define SFR_RM5_RM52(value)                   (SFR_RM5_RM52_Msk & ((value) << SFR_RM5_RM52_Pos))  
#define SFR_RM5_RM53_Pos                      _U_(12)                                              /**< (SFR_RM5) READ_MARGIN Value: uDCDirtyRam - 256 bytes (rf1p) - rf_256x8 (ARM926) Position */
#define SFR_RM5_RM53_Msk                      (_U_(0xF) << SFR_RM5_RM53_Pos)                       /**< (SFR_RM5) READ_MARGIN Value: uDCDirtyRam - 256 bytes (rf1p) - rf_256x8 (ARM926) Mask */
#define SFR_RM5_RM53(value)                   (SFR_RM5_RM53_Msk & ((value) << SFR_RM5_RM53_Pos))  
#define SFR_RM5_RM54_Pos                      _U_(16)                                              /**< (SFR_RM5) READ-WRITE_MARGIN Value: uMMU1, uMMU3 - 240 bytes (rf1p) - rf_32x30 (ARM926) Position */
#define SFR_RM5_RM54_Msk                      (_U_(0xF) << SFR_RM5_RM54_Pos)                       /**< (SFR_RM5) READ-WRITE_MARGIN Value: uMMU1, uMMU3 - 240 bytes (rf1p) - rf_32x30 (ARM926) Mask */
#define SFR_RM5_RM54(value)                   (SFR_RM5_RM54_Msk & ((value) << SFR_RM5_RM54_Pos))  
#define SFR_RM5_RM55_Pos                      _U_(20)                                              /**< (SFR_RM5) READ-WRITE_MARGIN Value: uMMU0, uMMU2 - 208 bytes (rf1p) - rf_32x26 (ARM926) Position */
#define SFR_RM5_RM55_Msk                      (_U_(0xF) << SFR_RM5_RM55_Pos)                       /**< (SFR_RM5) READ-WRITE_MARGIN Value: uMMU0, uMMU2 - 208 bytes (rf1p) - rf_32x26 (ARM926) Mask */
#define SFR_RM5_RM55(value)                   (SFR_RM5_RM55_Msk & ((value) << SFR_RM5_RM55_Pos))  
#define SFR_RM5_RM56_Pos                      _U_(24)                                              /**< (SFR_RM5) READ-WRITE_MARGIN Value: uICDataRam0, uICDataRam1, uICDataRam2, uICDataRam3,- 32 Kbytes (sram) - sram_2048x32 (ARM926). uDCDataRam0, uDCDataRam1, uDCDataRam2, uDCDataRam3 - 32 Kbytes (sram) - sram_2048x32sw1 (ARM926) Position */
#define SFR_RM5_RM56_Msk                      (_U_(0xF) << SFR_RM5_RM56_Pos)                       /**< (SFR_RM5) READ-WRITE_MARGIN Value: uICDataRam0, uICDataRam1, uICDataRam2, uICDataRam3,- 32 Kbytes (sram) - sram_2048x32 (ARM926). uDCDataRam0, uDCDataRam1, uDCDataRam2, uDCDataRam3 - 32 Kbytes (sram) - sram_2048x32sw1 (ARM926) Mask */
#define SFR_RM5_RM56(value)                   (SFR_RM5_RM56_Msk & ((value) << SFR_RM5_RM56_Pos))  
#define SFR_RM5_Msk                           _U_(0x0FFFFFFF)                                      /**< (SFR_RM5) Register Mask  */


/* -------- SFR_LS : (SFR Offset: 0x7C) (R/W 32) Light Sleep Register -------- */
#define SFR_LS_LS0_Pos                        _U_(0)                                               /**< (SFR_LS) Light Sleep Value (GFX2D) Position */
#define SFR_LS_LS0_Msk                        (_U_(0x1) << SFR_LS_LS0_Pos)                         /**< (SFR_LS) Light Sleep Value (GFX2D) Mask */
#define SFR_LS_LS0(value)                     (SFR_LS_LS0_Msk & ((value) << SFR_LS_LS0_Pos))      
#define SFR_LS_LS1_Pos                        _U_(1)                                               /**< (SFR_LS) Light Sleep Value (HLCDC5) Position */
#define SFR_LS_LS1_Msk                        (_U_(0x1) << SFR_LS_LS1_Pos)                         /**< (SFR_LS) Light Sleep Value (HLCDC5) Mask */
#define SFR_LS_LS1(value)                     (SFR_LS_LS1_Msk & ((value) << SFR_LS_LS1_Pos))      
#define SFR_LS_LS2_Pos                        _U_(2)                                               /**< (SFR_LS) Light Sleep Value (SDMMC) Position */
#define SFR_LS_LS2_Msk                        (_U_(0x1) << SFR_LS_LS2_Pos)                         /**< (SFR_LS) Light Sleep Value (SDMMC) Mask */
#define SFR_LS_LS2(value)                     (SFR_LS_LS2_Msk & ((value) << SFR_LS_LS2_Pos))      
#define SFR_LS_LS3_Pos                        _U_(3)                                               /**< (SFR_LS) Light Sleep Value (HUSB) Position */
#define SFR_LS_LS3_Msk                        (_U_(0x1) << SFR_LS_LS3_Pos)                         /**< (SFR_LS) Light Sleep Value (HUSB) Mask */
#define SFR_LS_LS3(value)                     (SFR_LS_LS3_Msk & ((value) << SFR_LS_LS3_Pos))      
#define SFR_LS_LS4_Pos                        _U_(4)                                               /**< (SFR_LS) Light Sleep Value (HXDMA) Position */
#define SFR_LS_LS4_Msk                        (_U_(0x1) << SFR_LS_LS4_Pos)                         /**< (SFR_LS) Light Sleep Value (HXDMA) Mask */
#define SFR_LS_LS4(value)                     (SFR_LS_LS4_Msk & ((value) << SFR_LS_LS4_Pos))      
#define SFR_LS_LS5_Pos                        _U_(5)                                               /**< (SFR_LS) Light Sleep Value (EHCI/OHCI) Position */
#define SFR_LS_LS5_Msk                        (_U_(0x1) << SFR_LS_LS5_Pos)                         /**< (SFR_LS) Light Sleep Value (EHCI/OHCI) Mask */
#define SFR_LS_LS5(value)                     (SFR_LS_LS5_Msk & ((value) << SFR_LS_LS5_Pos))      
#define SFR_LS_LS6_Pos                        _U_(6)                                               /**< (SFR_LS) Light Sleep Value (SRAM0) Position */
#define SFR_LS_LS6_Msk                        (_U_(0x1) << SFR_LS_LS6_Pos)                         /**< (SFR_LS) Light Sleep Value (SRAM0) Mask */
#define SFR_LS_LS6(value)                     (SFR_LS_LS6_Msk & ((value) << SFR_LS_LS6_Pos))      
#define SFR_LS_LS7_Pos                        _U_(7)                                               /**< (SFR_LS) Light Sleep Value (SRAM1 (OTPC)) (This bit is used by i_ahb_sram_otpc) Position */
#define SFR_LS_LS7_Msk                        (_U_(0x1) << SFR_LS_LS7_Pos)                         /**< (SFR_LS) Light Sleep Value (SRAM1 (OTPC)) (This bit is used by i_ahb_sram_otpc) Mask */
#define SFR_LS_LS7(value)                     (SFR_LS_LS7_Msk & ((value) << SFR_LS_LS7_Pos))      
#define SFR_LS_LS8_Pos                        _U_(8)                                               /**< (SFR_LS) Light Sleep Value (ROM + OTPC) (This bit is used by rom_16384x32_sys, rom_24576x32_ecc and otpc_rf_sc_264x32sw1) Position */
#define SFR_LS_LS8_Msk                        (_U_(0x1) << SFR_LS_LS8_Pos)                         /**< (SFR_LS) Light Sleep Value (ROM + OTPC) (This bit is used by rom_16384x32_sys, rom_24576x32_ecc and otpc_rf_sc_264x32sw1) Mask */
#define SFR_LS_LS8(value)                     (SFR_LS_LS8_Msk & ((value) << SFR_LS_LS8_Pos))      
#define SFR_LS_LS9_Pos                        _U_(9)                                               /**< (SFR_LS) Light Sleep Value (ARM926) Position */
#define SFR_LS_LS9_Msk                        (_U_(0x1) << SFR_LS_LS9_Pos)                         /**< (SFR_LS) Light Sleep Value (ARM926) Mask */
#define SFR_LS_LS9(value)                     (SFR_LS_LS9_Msk & ((value) << SFR_LS_LS9_Pos))      
#define SFR_LS_MEM_POWER_GATING_ULP1_EN_Pos   _U_(16)                                              /**< (SFR_LS) Light Sleep Value for ULP1 Power-Gated Memories Position */
#define SFR_LS_MEM_POWER_GATING_ULP1_EN_Msk   (_U_(0x1) << SFR_LS_MEM_POWER_GATING_ULP1_EN_Pos)    /**< (SFR_LS) Light Sleep Value for ULP1 Power-Gated Memories Mask */
#define SFR_LS_MEM_POWER_GATING_ULP1_EN(value) (SFR_LS_MEM_POWER_GATING_ULP1_EN_Msk & ((value) << SFR_LS_MEM_POWER_GATING_ULP1_EN_Pos))
#define SFR_LS_Msk                            _U_(0x000103FF)                                      /**< (SFR_LS) Register Mask  */

#define SFR_LS_LS_Pos                         _U_(0)                                               /**< (SFR_LS Position) Light Sleep Value (GFX2D) */
#define SFR_LS_LS_Msk                         (_U_(0x3FF) << SFR_LS_LS_Pos)                        /**< (SFR_LS Mask) LS */
#define SFR_LS_LS(value)                      (SFR_LS_LS_Msk & ((value) << SFR_LS_LS_Pos))         

