Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/* -------- SFR_CAL0 : (SFR Offset: 0xB0) (R/W 32) I/O Calibration 0 Register -------- */
#define SFR_CAL0_CALN_P0_Pos                  _U_(0)                                               /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDIOP0 Supply Position */
#define SFR_CAL0_CALN_P0_Msk                  (_U_(0xF) << SFR_CAL0_CALN_P0_Pos)                   /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDIOP0 Supply Mask */
#define SFR_CAL0_CALN_P0(value)               (SFR_CAL0_CALN_P0_Msk & ((value) << SFR_CAL0_CALN_P0_Pos))
#define SFR_CAL0_CALP_P0_Pos                  _U_(4)                                               /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDIOP0 Supply Position */
#define SFR_CAL0_CALP_P0_Msk                  (_U_(0xF) << SFR_CAL0_CALP_P0_Pos)                   /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDIOP0 Supply Mask */
#define SFR_CAL0_CALP_P0(value)               (SFR_CAL0_CALP_P0_Msk & ((value) << SFR_CAL0_CALP_P0_Pos))
#define SFR_CAL0_CALN_P1_Pos                  _U_(8)                                               /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDIOP1 Supply Position */
#define SFR_CAL0_CALN_P1_Msk                  (_U_(0xF) << SFR_CAL0_CALN_P1_Pos)                   /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDIOP1 Supply Mask */
#define SFR_CAL0_CALN_P1(value)               (SFR_CAL0_CALN_P1_Msk & ((value) << SFR_CAL0_CALN_P1_Pos))
#define SFR_CAL0_CALP_P1_Pos                  _U_(12)                                              /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDIOP1 Supply Position */
#define SFR_CAL0_CALP_P1_Msk                  (_U_(0xF) << SFR_CAL0_CALP_P1_Pos)                   /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDIOP1 Supply Mask */
#define SFR_CAL0_CALP_P1(value)               (SFR_CAL0_CALP_P1_Msk & ((value) << SFR_CAL0_CALP_P1_Pos))
#define SFR_CAL0_CALN_ANA_Pos                 _U_(16)                                              /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDANA Supply Position */
#define SFR_CAL0_CALN_ANA_Msk                 (_U_(0xF) << SFR_CAL0_CALN_ANA_Pos)                  /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDANA Supply Mask */
#define SFR_CAL0_CALN_ANA(value)              (SFR_CAL0_CALN_ANA_Msk & ((value) << SFR_CAL0_CALN_ANA_Pos))
#define SFR_CAL0_CALP_ANA_Pos                 _U_(20)                                              /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDANA Supply Position */
#define SFR_CAL0_CALP_ANA_Msk                 (_U_(0xF) << SFR_CAL0_CALP_ANA_Pos)                  /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDANA Supply Mask */
#define SFR_CAL0_CALP_ANA(value)              (SFR_CAL0_CALP_ANA_Msk & ((value) << SFR_CAL0_CALP_ANA_Pos))
#define SFR_CAL0_CALN_QSPI_Pos                _U_(24)                                              /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDQSPI Supply Position */
#define SFR_CAL0_CALN_QSPI_Msk                (_U_(0xF) << SFR_CAL0_CALN_QSPI_Pos)                 /**< (SFR_CAL0) Calibration of Low Level Output Impedance of Pads with VDDQSPI Supply Mask */
#define SFR_CAL0_CALN_QSPI(value)             (SFR_CAL0_CALN_QSPI_Msk & ((value) << SFR_CAL0_CALN_QSPI_Pos))
#define SFR_CAL0_CALP_QSPI_Pos                _U_(28)                                              /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDQSPI Supply Position */
#define SFR_CAL0_CALP_QSPI_Msk                (_U_(0xF) << SFR_CAL0_CALP_QSPI_Pos)                 /**< (SFR_CAL0) Calibration of High Level Output Impedance of Pads with VDDQSPI Supply Mask */
#define SFR_CAL0_CALP_QSPI(value)             (SFR_CAL0_CALP_QSPI_Msk & ((value) << SFR_CAL0_CALP_QSPI_Pos))
#define SFR_CAL0_Msk                          _U_(0xFFFFFFFF)                                      /**< (SFR_CAL0) Register Mask  */


/* -------- SFR_CAL1 : (SFR Offset: 0xB4) (R/W 32) I/O Calibration 1 Register -------- */
#define SFR_CAL1_CALN_M_Pos                   _U_(0)                                               /**< (SFR_CAL1) Calibration of Low Level Output Impedance of Pads with VDDIOM Supply Position */
#define SFR_CAL1_CALN_M_Msk                   (_U_(0xF) << SFR_CAL1_CALN_M_Pos)                    /**< (SFR_CAL1) Calibration of Low Level Output Impedance of Pads with VDDIOM Supply Mask */
#define SFR_CAL1_CALN_M(value)                (SFR_CAL1_CALN_M_Msk & ((value) << SFR_CAL1_CALN_M_Pos))
#define SFR_CAL1_CALP_M_Pos                   _U_(4)                                               /**< (SFR_CAL1) Calibration of High Level Output Impedance of Pads with VDDIOM Supply Position */
#define SFR_CAL1_CALP_M_Msk                   (_U_(0xF) << SFR_CAL1_CALP_M_Pos)                    /**< (SFR_CAL1) Calibration of High Level Output Impedance of Pads with VDDIOM Supply Mask */
#define SFR_CAL1_CALP_M(value)                (SFR_CAL1_CALP_M_Msk & ((value) << SFR_CAL1_CALP_M_Pos))
#define SFR_CAL1_TEST_M_Pos                   _U_(8)                                               /**< (SFR_CAL1) Enable Calibration of Low/High Level Output Impedance of Pads with VDDIOM Supply Position */
#define SFR_CAL1_TEST_M_Msk                   (_U_(0x1) << SFR_CAL1_TEST_M_Pos)                    /**< (SFR_CAL1) Enable Calibration of Low/High Level Output Impedance of Pads with VDDIOM Supply Mask */
#define SFR_CAL1_TEST_M(value)                (SFR_CAL1_TEST_M_Msk & ((value) << SFR_CAL1_TEST_M_Pos))
#define SFR_CAL1_Msk                          _U_(0x000001FF)                                      /**< (SFR_CAL1) Register Mask  */


/* -------- SFR_WPMR : (SFR Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SFR_WPMR_WPEN_Pos                     _U_(0)                                               /**< (SFR_WPMR) Write Protection Enable Position */
#define SFR_WPMR_WPEN_Msk                     (_U_(0x1) << SFR_WPMR_WPEN_Pos)                      /**< (SFR_WPMR) Write Protection Enable Mask */
#define SFR_WPMR_WPEN(value)                  (SFR_WPMR_WPEN_Msk & ((value) << SFR_WPMR_WPEN_Pos))
#define SFR_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (SFR_WPMR) Write Protection Key Position */
#define SFR_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << SFR_WPMR_WPKEY_Pos)                /**< (SFR_WPMR) Write Protection Key Mask */
#define SFR_WPMR_WPKEY(value)                 (SFR_WPMR_WPKEY_Msk & ((value) << SFR_WPMR_WPKEY_Pos))
#define   SFR_WPMR_WPKEY_PASSWD_Val           _U_(0x534652)                                        /**< (SFR_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SFR_WPMR_WPKEY_PASSWD                 (SFR_WPMR_WPKEY_PASSWD_Val << SFR_WPMR_WPKEY_Pos)    /**< (SFR_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define SFR_WPMR_Msk                          _U_(0xFFFFFF01)                                      /**< (SFR_WPMR) Register Mask  */


