Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sfr.h
/* -------- SFR_SPARE : (SFR Offset: 0x100) (R/W 32) Spare Register -------- */
#define SFR_SPARE_VALUE_Pos                   _U_(0)                                               /**< (SFR_SPARE) Spare Position */
#define SFR_SPARE_VALUE_Msk                   (_U_(0xFFFFFFFF) << SFR_SPARE_VALUE_Pos)             /**< (SFR_SPARE) Spare Mask */
#define SFR_SPARE_VALUE(value)                (SFR_SPARE_VALUE_Msk & ((value) << SFR_SPARE_VALUE_Pos))
#define SFR_SPARE_Msk                         _U_(0xFFFFFFFF)                                      /**< (SFR_SPARE) Register Mask  */


/* -------- SFR_BU_SPARE : (SFR Offset: 0x104) (R/W 32) Spare Register (BackUp) -------- */
#define SFR_BU_SPARE_VALUE_Pos                _U_(0)                                               /**< (SFR_BU_SPARE) Spare Position */
#define SFR_BU_SPARE_VALUE_Msk                (_U_(0xFFFF) << SFR_BU_SPARE_VALUE_Pos)              /**< (SFR_BU_SPARE) Spare Mask */
#define SFR_BU_SPARE_VALUE(value)             (SFR_BU_SPARE_VALUE_Msk & ((value) << SFR_BU_SPARE_VALUE_Pos))
#define SFR_BU_SPARE_Msk                      _U_(0x0000FFFF)                                      /**< (SFR_BU_SPARE) Register Mask  */


/** \brief SFR register offsets definitions */
#define SFR_CCFG_EBICSA_REG_OFST       (0x04)              /**< (SFR_CCFG_EBICSA) EBI Chip Select Register Offset */
#define SFR_OHCIICR_REG_OFST           (0x10)              /**< (SFR_OHCIICR) OHCI Interrupt Configuration Register Offset */
#define SFR_OHCIISR_REG_OFST           (0x14)              /**< (SFR_OHCIISR) OHCI Interrupt Status Register Offset */
#define SFR_BU_OTPC_CONF_R0_REG_OFST   (0x18)              /**< (SFR_BU_OTPC_CONF_R0) OTPC Configuration 0 Register (BackUp) Offset */
#define SFR_BU_OTPC_CONF_R1_REG_OFST   (0x1C)              /**< (SFR_BU_OTPC_CONF_R1) OTPC Configuration 1 Register (BackUp) Offset */
#define SFR_BU_RC_XTAL_TRIM_REG_OFST   (0x20)              /**< (SFR_BU_RC_XTAL_TRIM) RC and XTAL Oscillator Trimming Register (BackUp) Offset */
#define SFR_UTMICKTRIM_REG_OFST        (0x30)              /**< (SFR_UTMICKTRIM) UTMI Clock Trimming Register Offset */
#define SFR_UTMIHSTRIM_REG_OFST        (0x34)              /**< (SFR_UTMIHSTRIM) UTMI High-Speed Trimming Register Offset */
#define SFR_UTMIFSTRIM_REG_OFST        (0x38)              /**< (SFR_UTMIFSTRIM) UTMI Full-Speed Trimming Register Offset */
#define SFR_UTMISWAP_REG_OFST          (0x3C)              /**< (SFR_UTMISWAP) UTMI DP/DM Pin Swapping Register Offset */
#define SFR_RM0_REG_OFST               (0x5C)              /**< (SFR_RM0) Read Margin0 Register Offset */
#define SFR_RM1_REG_OFST               (0x60)              /**< (SFR_RM1) Read Margin1 Register Offset */
#define SFR_RM2_REG_OFST               (0x64)              /**< (SFR_RM2) Read Margin2 Register Offset */
#define SFR_RM3_REG_OFST               (0x68)              /**< (SFR_RM3) Read Margin3 Register Offset */
#define SFR_RM4_REG_OFST               (0x6C)              /**< (SFR_RM4) Read Margin4 Register Offset */
#define SFR_RM5_REG_OFST               (0x70)              /**< (SFR_RM5) Read Margin5 Register Offset */
#define SFR_LS_REG_OFST                (0x7C)              /**< (SFR_LS) Light Sleep Register Offset */
#define SFR_CAL0_REG_OFST              (0xB0)              /**< (SFR_CAL0) I/O Calibration 0 Register Offset */
#define SFR_CAL1_REG_OFST              (0xB4)              /**< (SFR_CAL1) I/O Calibration 1 Register Offset */
#define SFR_WPMR_REG_OFST              (0xE4)              /**< (SFR_WPMR) Write Protection Mode Register Offset */
#define SFR_SPARE_REG_OFST             (0x100)             /**< (SFR_SPARE) Spare Register Offset */
#define SFR_BU_SPARE_REG_OFST          (0x104)             /**< (SFR_BU_SPARE) Spare Register (BackUp) Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SFR register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       SFR_CCFG_EBICSA;    /**< Offset: 0x04 (R/W  32) EBI Chip Select Register */
  __I   uint8_t                        Reserved2[0x08];
  __IO  uint32_t                       SFR_OHCIICR;        /**< Offset: 0x10 (R/W  32) OHCI Interrupt Configuration Register */
  __I   uint32_t                       SFR_OHCIISR;        /**< Offset: 0x14 (R/   32) OHCI Interrupt Status Register */
  __IO  uint32_t                       SFR_BU_OTPC_CONF_R0; /**< Offset: 0x18 (R/W  32) OTPC Configuration 0 Register (BackUp) */
  __IO  uint32_t                       SFR_BU_OTPC_CONF_R1; /**< Offset: 0x1C (R/W  32) OTPC Configuration 1 Register (BackUp) */
  __IO  uint32_t                       SFR_BU_RC_XTAL_TRIM; /**< Offset: 0x20 (R/W  32) RC and XTAL Oscillator Trimming Register (BackUp) */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       SFR_UTMICKTRIM;     /**< Offset: 0x30 (R/W  32) UTMI Clock Trimming Register */
  __IO  uint32_t                       SFR_UTMIHSTRIM;     /**< Offset: 0x34 (R/W  32) UTMI High-Speed Trimming Register */
  __IO  uint32_t                       SFR_UTMIFSTRIM;     /**< Offset: 0x38 (R/W  32) UTMI Full-Speed Trimming Register */
  __IO  uint32_t                       SFR_UTMISWAP;       /**< Offset: 0x3C (R/W  32) UTMI DP/DM Pin Swapping Register */
  __I   uint8_t                        Reserved4[0x1C];
  __IO  uint32_t                       SFR_RM0;            /**< Offset: 0x5C (R/W  32) Read Margin0 Register */
  __IO  uint32_t                       SFR_RM1;            /**< Offset: 0x60 (R/W  32) Read Margin1 Register */
  __IO  uint32_t                       SFR_RM2;            /**< Offset: 0x64 (R/W  32) Read Margin2 Register */
  __IO  uint32_t                       SFR_RM3;            /**< Offset: 0x68 (R/W  32) Read Margin3 Register */
  __IO  uint32_t                       SFR_RM4;            /**< Offset: 0x6C (R/W  32) Read Margin4 Register */
  __IO  uint32_t                       SFR_RM5;            /**< Offset: 0x70 (R/W  32) Read Margin5 Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       SFR_LS;             /**< Offset: 0x7C (R/W  32) Light Sleep Register */
  __I   uint8_t                        Reserved6[0x30];
  __IO  uint32_t                       SFR_CAL0;           /**< Offset: 0xB0 (R/W  32) I/O Calibration 0 Register */
  __IO  uint32_t                       SFR_CAL1;           /**< Offset: 0xB4 (R/W  32) I/O Calibration 1 Register */
  __I   uint8_t                        Reserved7[0x2C];
  __IO  uint32_t                       SFR_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved8[0x18];
  __IO  uint32_t                       SFR_SPARE;          /**< Offset: 0x100 (R/W  32) Spare Register */
  __IO  uint32_t                       SFR_BU_SPARE;       /**< Offset: 0x104 (R/W  32) Spare Register (BackUp) */
} sfr_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_SFR_COMPONENT_H_ */
